{
  "canvas": {
    "11": "Aggiungi una nuova nota",
    "12": "Applica il modelllo",
    "13": "Nessuno",
    "17": "Ricarica",
    "18": "*Modificami* ###### Doppio click"
  },
  "create-lobby": {
    "1": "Nome",
    "2": "Codice",
    "3": "Descrizione",
    "4": "Obiettivi di apprendimento e risultati di apprendimento attesi",
    "9": "Salva",
    "10": "Elimina"
  },
  "create-team": { "1": "Crea una nuova sfida" },
  "edit-team": {
    "1": "Modifica sfida",
    "2": "Nome:",
    "3": "Descrizione della sfida:",
    "4": "Categoria mini game",
    "5": "Mini game",
    "6": "Istruzioni",
    "7": "Modello in Snap",
    "10": "Salva",
    "11": "Elimina"
  },
  "in-code": {
    "1": "Nuovo corso creato",
    "2": "Nuova sfida creata",
    "3": "Si è verificato un errore",
    "4": "Parametri non validi",
    "6": "Iscritto/a al corso",
    "7": "Failed to join course",
    "8": "Hai abbandonato il corso",
    "9": "Modifiche salvate",
    "10": "Connesso",
    "11": "Password errata",
    "12": "Username non valido",
    "13": "Successo",
    "14": "Errore",
    "15": "Il corso non esiste",
    "16": "Sei già membro del corso",
    "17": "Registrazione avvenuta con successo",
    "18": "Registrazione fallita",
    "19": "Username già esistente",
    "20": "Email già esistente",
    "21": "L'username non può essere vuoto",
    "22": "Le password non corrispondono",
    "23": "Cancella",
    "24": "Are you sure?",
    "25": "Si",
    "26": "No"
  },
  "lobbies": {
    "1": "Corso creato",
    "3": "Crea un nuovo corso",
    "4": "Iscriviti con il codice",
    "5": "Iscizione"
  },
  "lobby-page": {
    "1": "Creato da:",
    "2": "Impostazioni del corso",
    "3": "Crea una nuova sfida",
    "6": "Sfide",
    "7": "Descrizione della sfida:",
    "8": "Risposte",
    "9": "Risposte del corso",
    "10": "Brainstorm canvas",
    "14": "Membri:"
  },
  "lobby-settings": {
    "1": "Impostazioni del corso",
    "2": "Nome:",
    "3": "Descrizione:",
    "4": "Obiettivi di apprendimento e risultati di apprendimento attesi:",
    "9": "Ok",
    "10": "Salva",
    "11": "Elimina"
  },
  "login": {
    "1": "Login",
    "2": "Username o E-mail",
    "3": "Password",
    "4": "Login",
    "5": "Ricordami"
  },
  "navbar": {
    "2": "Corsi",
    "3": "Revisione",
    "4": "Verifica",
    "6": "Feedback",
    "7": "Logout",
    "8": "Login",
    "9": "Registrazione",
    "10": "Aiuto",
    "11": "Brainstorm"
  },
  "register": {
    "1": "Registrazione",
    "2": "Username",
    "3": "Password",
    "4": "Verifica password",
    "5": "E-mail",
    "6": "Nome",
    "7": "Cognome",
    "8": "Sottoscrivi",
    "9": "Questo sito richiede l'indirizzo e-mail e il nome per funzionare correttamente. Per continuare ad utilizzare Coding4Girls, è necessario accettare la nostra politica sulla privacy.",
    "10": "Informativa sulla privacy",
    "11": "Ho letto e accetto i termini di Coding4Girls"
  },
  "minigameHeaders": {
    "1": "Nessuno",
    "2": "Loop",
    "3": "Condizionali",
    "4": "Variabili",
    "5": "Istruzioni",
    "6": "Parallelismo",
    "7": "Operatori",
    "8": "Eventi",
    "9": "Multiple Choice Questions"
  },
  "minigameCategories": {
    "1": "Nessuno",
    "2": "Loop",
    "3": "Condizionali",
    "4": "Tipi di dati",
    "5": "Strutture dei dati",
    "6": "Sequenza delle istruzioni",
    "7": "Suoni",
    "8": "Movimento",
    "9": "Aspetto",
    "10": "Disegno",
    "11": "Suoni / movimenti / personaggi / interazioni simultanei",
    "12": "4 basic operations",
    "13": "Modulo, roundings",
    "14": "Advanced, sin, cos, sqrt, power, roundings",
    "15": "AND/OR/NOT, booleans, ==",
    "16": "Casuale",
    "17": "Suoni / movimenti / personaggi / interazioni simultanei",
    "18": "Eventi"
  },
  "minigame": {
    "1": "Corrispondenze a 3",
    "2": "Trova il tuo percorso",
    "3": "Gioco dell'inventario",
    "4": "Livelli del gioco",
    "5": "Volume del gioco",
    "6": "Gioco Snake",
    "7": "Puzzle",
    "8": "Giochi di abbinamento",
    "9": "Gioco dei dadi",
    "10": "Risposte multiple"
  },
  "variables": {
    "1": "Timer",
    "2": "Famiglia di operazioni",
    "3": "Operazioni basi",
    "4": "Operazioni avanzate",
    "5": "Trigonometria",
    "6": "Tutto",
    "7": "Risposta esatta",
    "8": "Risposta sbagliata",
    "9": "Domanda",
    "10": "Risposta"
  },
  "privacy": {
    "1": "Politica sulla Privacy",
    "2": "Una delle nostre priorità principali è la privacy dei nostri visitatori. Il presente documento sulla politica di privacy contiene i tipi di informazioni raccolte e registrate dalla piattaforma Coding4Girls e il modo in cui le utilizziamo.",
    "3": "Se haidomande o vuoi ulteriori informazioni sulla nostra Informativa sulla privacy, non esitare a contattarci tramite e-mail all'indirizzo olivier.heidmann@gmail.com",
    "4": "Regolamento generale sulla protezione dei dati (GDPR)",
    "5": "Siamo il Titolare sul trattamento dei tuoi dati",
    "6": "La base giuridica di Coding4Girls per la raccolta e l'utilizzo delle informazioni personali descritte nella presente Informativa sulla privacy dipende dalle Informazioni personali che raccogliamo e dal contesto specifico in cui raccogliamo le informazioni:",
    "7": "Coding4Girls deve stipulare un contratto con te",
    "8": "Hai dato a Coding4Girls il permesso di farlo",
    "9": "Il trattamento dei dati personali è nell'interesse legittimo di Coding4Girls",
    "10": "Coding4Girls deve rispettare la legge",
    "11": "Coding4Girls conserverà le tue informazioni personali solo per il tempo necessario agli scopi stabiliti nella presente Informativa sulla privacy. Conserveremo e utilizzeremo le tue informazioni nel tempo necessario per ottemperare ai nostri obblighi legali, risolvere controversie e applicare le nostre politiche.",
    "12": "Se risiedi nel' area economica europea (EEA), hai determinati diritti di protezione dei dati. Se desideri essere informato su quali Dati personali deteniamo su di te e se desideri che vengano rimossi dai nostri sistemi, ti preghiamo di contattarci.",
    "13": "In determinate circostanze, hai i seguenti diritti di protezione dei dati:",
    "14": "Il diritto di accedere, aggiornare o eliminare le tue informazioni personali in nostro possesso.",
    "15": "Il diritto di rettifica",
    "16": "Il diritto di opporsi",
    "17": "Il diritto di restrizione",
    "18": "Il diritto alla portabilità dei dati",
    "19": "Il diritto di revocare il consenso",
    "20": "Log files",
    "21": "La piattaforma Coding4Girls segue una procedura standard di utilizzo dei log files. Questi log files tengono traccia dei visitatori quando aprono i siti Web. \n Tutte le società di hosting registrano e analizzano questi dati. Le informazioni raccolte dai log files includono indirizzi IP (Internet Protocol), tipo di browser, Internet Service Provider (ISP), data e ora, pagine di riferimento / uscita e numero di clic. Questi non sono collegati ad alcuna informazione che permetta l'identificazione dell'utente. \n Lo scopo delle informazioni è di analizzare le tendenze, amministrare il sito, tenere traccia dei movimenti degli utenti sul sito Web e raccogliereinformazioni sull'interattività con la piattaforma.",
    "22": "Informazioni per bambini",
    "23": "Un'altra nostra priorità è l'aggiunta di protezione per i bambini durante l'utilizzo di Internet. Incoraggiamo genitori e tutor a osservare, partecipare e / o monitorare e guidare la loro attività online.",
    "24": "La piattaforma Coding4Girls non raccoglie consapevolmente alcuna informazione personale identificabile da bambini di età inferiore ai 13 anni. Se ritieni che tuo figlio abbia fornito questo tipo di informazioni sul nostro sito Web, ti consigliamo di contattarci immediatamente e faremo del nostro meglio per rimuovere tali informazioni dai nostri archivi.",
    "25": "Informativa sulla privacy online",
    "26": "La nostra Informativa sulla privacy si applica solo alle nostre attività online ed è valida per i visitatori del nostro sito Web per quanto riguarda le informazioni che hanno condiviso e / o raccolto nella piattaforma Coding4Girls. Questa politica non è applicabile alle informazioni raccolte offline o tramite canali diversi da questo sito Web.",
    "27": "Consenso",
    "28": "Utilizzando il nostro sito Web, acconsenti alla nostra Informativa sulla privacy e accetti i suoi termini."
  },
  "home": {
    "3": "CODING4GIRLS ha un design basato su un approccio pedagogico fortemente legato a soluzioni centrate sull'uomo. Questo approccio guida gli studenti a vedere il quadro generale prima di progettare una soluzione dettagliata, li incoraggia a considerare gli interessi della comunità e li sfida a pensare in modo imprenditoriale su come le tecnologie digitali possono essere utilizzate per affrontare i problemi del mondo reale.",
    "4": "Lo strumento è stato progettato e sviluppato nell'ambito del progetto Erasmus + <i> Coding4Girls </i>, 2018-1-SI01-KA201-047013.",
    "5": "Questo sito Web è ottimizzato per la visualizzazione in Google Chrome"
  }
}
